/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error_log.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rohta <rohta@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/04/12 18:06:08 by rohta             #+#    #+#             */
/*   Updated: 2025/04/21 23:52:18 by rohta            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fractol.h"

void	error_print(int n)
{
	if (n == 1)
	{
		ft_printf("引数が足りません。\n");
	}
	if (n == 2)
	{
		ft_printf("入力値に誤りがあります。\n");
		ft_printf("正しいフラクタルの図形を入力してください。\n");
	}
	if (n == 1 || n == 2)
	{
		ft_printf("MandelbrotまたはJuliaと入力してください。\n");
		ft_printf("Juliaの場合は2つのパラメーターを入力してください。\n");
	}
}
